tutorials/multiphase/waves/waveSolver/3Dwaves/0/p_rgh.org
/*---------------------------------------------------------------------------*\
 Caelus 7.04                                   
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet0
    {
        type            zeroGradient;
    }
    inlet1
    {
        type            zeroGradient;
    }
    inlet2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmos
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    internalWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
